<!--
 * @Description:
 * @LastEditTime: 2023-12-15 18:48:48
 * @LastEditors: wudi
 * @Author: 刘仁秀
 * @Date: 2022-09-02 15:21:16
-->
<template>
  <view class="page">
    <backTop ref="top"></backTop>
    <view class="content text-28 color-base">
      {{
        setting.companyName
      }}（下称“我们”）非常重视用户(下称“您”）的隐私和个人信息保护。您在使用我们的产品或服务时，我们可能会收集和使用您的相关个人信息。通过本隐私政策向您说明我们在提供产品或服务时如何收集、使用、保存、共享和转让您的个人信息、您享有的个人信息用户权利以及我们如何保障您的个人信息安全。
      本隐私政策与您所使用的“{{
        setting.appName
      }}”以及该服务所包括的各种业务功能（下称“我们的产品或服务”)息息相关，希望您在使用我们的产品或服务前仔细阅读并确认您已经充分知悉并理解本政策所陈述的内容，并让您可以按照本隐私政策的指引做出您认为适当的选择。一旦您开始使用或在我们更新本隐私政策后继续使用我们的产品或服务，即表示您已充分理解并同意本政策(含更新版本)内容。并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。
      <br />
      <br />
      <view class="bold">一、您个人信息的收集和使用</view>
      为了向您提供服务，我们含按照如下方式收集、使用您的个人信息:
      <br />
      (一)实现实名签发文件所必须的功能
      <br />
      1.账号注册信息:当您首次注册“{{
        setting.appName
      }}”账号时，您需要提供您的手机号码或邮箱地址并创建登录密码，上述信息为您注册“{{
        setting.appName
      }}”账号所必需，若您不提供这类信息，您将无法继续使用我们的服务。
      <br />
      2.实名认证信息:在您使用“{{
        setting.appName
      }}”账号签发文件前，您需要进行实名认证，实名认证需要提供您的真实姓名、身份证号码、手机号码、以及面部照片；当您自动审核不通过或您不属于大陆居民时，您需提供能代表您身份的证件信息(包括居民身份证号，护照号，回乡证号，台胞证号等）及图片进行人工审核认证。收集此类信息的目的满足相关法律法规的实名制要求，若您不提供这类信息，您将无法完成实名认证。亦无法以实名身份签发文件，但不会影响您使用“{{
        setting.appName
      }}”产品或服务的浏览等基本功能。
      <br />
      3.数字证书信息:实名认证通过后“{{
        setting.appName
      }}”会为您颁发数字证书，我们会保留您的数字证书信息，此信息包含您的姓名、身份证件信息，以及为您申请的数字证书序列号，以便供您在签发文件时调用。若您不授权我们保存此信息，您将无法正常使用我们的签发服务。
      <br />
      (二)向您提供产品或服务
      <br />
      当您使用“{{
        setting.appName
      }}”服务时，为了维护我们服务的正常运行，改进及优化您的服务体验以及保障您的账号安全，我们会收集您下述信息:
      <br />
      1.设备信息:我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信急(包括IP地址等软硬件特征信息）∶我们会基于提供更便捷、更优质的服务和体验收集您的某些设备权限；
      <br />
      1)相机摄像头权限:获取相机摄像头权限是用于实名认证、刷脸签署等特定的业务场景，我们将在取得您的授权同意后进行;
      <br />
      2)文件照片的访问权限:获取文件照片访问权限是在特定的场景下您可选择上传您文件照片作为签署载体；
      <br />
      请您知悉获取上述权限的前提条件是您在您的设备中已允许开启相机/摄像头、照片访问权限、存储权限以实现这些权限所涉及信息的收集和使用。您可在您的设备的设置/应用权限(不同的设备类型有所不同)
      中查看上述权限的状态，并可根据需要选择开启或关闭相应的权限。请您注意，您开启任一权限即代表您授权我们可以收集或使用相关个人信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但不会影响此前基于您的授权所进行的信息收集及使用。
      <br />
      2.日志信息:我们会收集您对我们服务的详细使用情况，作为有关日志保存，包括接入网络的方式、类型和状态、网络质量数据、操作日志、服务日志信息。
      <br />
      3.您通过我们的客服、网站留言或参加我们举办的活动时所提交的个人信忽:当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方或等信息，以便与您取得联系或帮助您解决定位问题，或记泵相关问题的处理方案及结果。
      <br />
      4.出证信息:当您向我们申请出证时，您需要向我们提供您的收件信息，包括收件人姓名、收件人手机号/座机、收件地址，由于出证材料属于纸质材料，获取您的收件地址是方便能顺利将出证材料寄出并安全的抵达您的手中。
      <br />
      5.电子邮箱地址:当您希望通过邮箱来接收我们服务相关的通知时，您可以通过在个人中心绑定您的电子邮箱地址，请您知悉邮箱地址仅为可边信息，拒绝提供该信息不会影响您的使用体验，您依然可以通过短信来接收相关的通知。
      <br />
      (三)其他用途
      <br />
      如果我们基于本政策未载明的其他特定目的收集您的个人信息时，会事先征求您的授权同意。我们收集及使用上述信息的目的是为了更好地经营“{{
        setting.appName
      }}”产品和服务，如有更新我们会通过包括但不限于通过网站公告、电子邮件、电话或短信等方或通知您。
      如我们停止运营“{{
        setting.appName
      }}”产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或通过公告的形式告知您，并对所持有的个人信息进行删除或匿名化处理。
      <br />
      (四）授权同意的例外
      <br />
      您充分知晓，根据相关法律法规的要求，以下情形中，较们收集、使用您的个人信息无需征得您的授权同意:
      <br />
      a)与个人信息控制者履行法律法规规定的义务相关的;
      <br />
      b)与国家安全、国防安全信息相关的;
      <br />
      c)与公共安全、公共卫生、重大公共利益直接相关的;
      <br />
      d)与刑事侦查、起诉、审判和判决执行等直接相关的;
      <br />
      e)出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的;
      <br />
      f)所涉及的个人信息是个人信息主体自行向社会公众公开的;g)根据个人信息主体要求签订和履行合同所必需的;
      <br />
      h)从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道;
      <br />
      i)维护所提供产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障;
      <br />
      j)个人信息控制者为新闻单位，且其开展合法的新闻报道所必需的;
      <br />
      k)个人信息控制者为学术研究机构，出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结桨中所包含的个人信息进行去标识化处理的。

      <br />
      <br />
      <view class="bold">二、Cookie和同类技术的应用</view>
      为使您获得更轻松的访问体验，您使用我们的产品或服务时，我们可能会通过采用各种技术收集和存储您访问“{{
        setting.appName
      }}”服务的相关数据，在您访问或再次访问“{{
        setting.appName
      }}”服务时，我们能识别您的身份，并通过分析数据为您提供更好更多的服务。包括使用小型数据文件识别您的身份，这么做是为了解您的使用习惯，帮您省去重复输入账户信息的步骤，或者帮助判断您的登录状态以及账户安全。这些数据文件可能是Cookie、Flash
      Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”) .
      我们不会将Cookies用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookies。您可以清除计算机上保存的所有Cookies，大部分网络浏览器会自动接受
      Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝Cookies:另外，您也可以清除软件内保存的所有Cookies.但如果您这么做，您可能需要在每一次访问我们的网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除。

      <br />
      <br />
      <view class="bold">三、您个人信息的共享、转让、公开披露</view>
      (一)共享
      <br />
      我们不会与“{{
        setting.appName
      }}”服务提供者以外的任何公司、组织和个人共享您的个人信息，但以下情况除外:
      <br />
      1.事先获得您明确的同意或授权;
      <br />
      2.根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供;
      <br />
      3.只有共享您的某些信息，才能实现我们的产品或服务的核心功能或提供您需要的服务:
      <br />
      4.应您合法需求，协助处理您与他人的纠纷或争议;
      <br />
      5.应您的监护人合法要求而提供您的信息；
      <br />
      6.根据与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供;
      <br />
      7.基于符合法律法规的社会公共利益而使用;
      <br />
      8.与授权的供应商和服务提供方共享:为实现本隐私政策中声明的目的，我们会与我们的供应商和服务提供商共享您的某些个人信息，具体如下:
      <br />
      (1)我们会将您的真实姓名、身份证号码、手机号码、以及面部照片共享给实名认证机构。
      <br />
      (2)通过SDK方式共享:某些产品或服务可能由我们服务提供方提供，我们会通过SDK的形或向您提供产品或服务，在此过程中，我们的服务提供方可能会收集、使用和存储你的相关数据或信忽。
      我们会按照内部标准，必要时开展个人信息安全影响评估，根据评估结果严格筛选和业务所必须的合作伙伴，并对获取您个人信息的第三方API
      SDK开展安全检测，并与授权合作伙伴约定严格的数据保护措施，令其按照我们的委托目的、服务说明、本隐私权政策以及其他任何相关的保密和安全措施来处理您的个人信息。如需获悉关于我们接入使用的第三方SDK收集、使用APP最终用户个人信息的类型和目的以及其他任何相关的保密和安全措施，可前往其官网参阅其详细隐私政策。请您知悉我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。同时我们制定供应商管理内控流程，定期对合作伙停的服务、安全能力、舆情进行评估和监控，一旦发现我们的合作伙伴有遶法违规行为，我们会予以核实后及时中止与这些第三方的合作，及时保障用户权益。如您在使用过程中对我们使用的第三方服务和供应商有任何疑问您可通过本政策中提供的联系方式与我们取得联系。我们会及时解答您的疑惑。
      <br />
      (二）转让
      <br />
      我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外:
      <br />
      1.在获取明确同意的情况下转让:获得您的明确同意后，我们会向其他方转让您的个人信息:
      <br />
      2.在“{{
        setting.appName
      }}”服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的的束，否则我们将要求该公司、组织和个人重新向您征求授权同意。
      <br />
      (三)公开披露
      <br />
      我们仅会在以下情况下，才会披露您的信息:
      <br />
      1.根据您的需求，在您明确同意的披露方或下披露您所指定的信息:
      <br />
      2.根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的诱求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门或相关机构因特定调查目的且有合法权利获取的数据。在向相关强制性的行政执法或司法机关披露后且前述机关允许的前提下，我们会及时通过合理的方式通知您。
      <br />
      (四）共享、转让、公开披露个人信息时事先征得授权同意的例外
      <br />
      以下情形中，我们共享、转让、公开披露您的个人信息无需事先征得您的授权同意:
      <br />
      1.与个人信息控制者履行法律法规规定的义务相关的;
      <br />
      2.与国家安全、国防安全直接相关的;
      <br />
      3.与公共安全、公共卫生、重大公共利益直接相关的;
      <br />
      4.与刑事侦查犯罪侦查、起诉、审判和判决执行等直接相关的:
      <br />
      5.出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的:
      <br />
      6.您自行向社会公众公开的个人信息:
      <br />
      7.从合法公开披露的信息中收集个人信息的，如合法的新阔报道、政府信息公开等渠通。
      <br />
      (五）提供证明
      <br />
      对于通过“{{
        setting.appName
      }}”平台签订的数据电文等法律文件，我们有权将前述法律文件的签署信息如当事人姓名或者名称、统一社会信用代码证（或者组织机构代码证）等号码、身份证号码、数字证书号码、IP地址、签订时间等披露给数据电文的签约当事人作为法律文件的签订证据。
      <br />
      (六）您的个人信息储存期限以及超期的处理方式
      <br />
      《中华人民共和国电子签名法》第二十四条规定“电子认证服务提供者应当妥善保存与认证相关的信息，信息保存期限至少为电子签名认证证书失效后五年。因此，您的个人信息可免费储存五年，超过五年，您未作任何处理也不支付费用的，我们有权删除且不承担任何法律责任。

      <br />
      <br />
      <view class="bold">四、您个人信息的保护和保存</view>
      我们在中华人民共和国境内运营“{{
        setting.appName
      }}”服务中收集和产生的信息，仅存储在中华人民共和国境内。
      <br />
      我们将采取以下手段保护您的信息:
      <br />
      (一)我们会采用符合业界标准的安全防护措施，安全技术解决方案来防止您的信息遭到未经授权的访问、使用、篡改,避免数据的损坏丢失或泄露。我们提供的应用服务使用全站https传输协议，采用由我们颁发的TLS/SSL证书加密传输，确保您的数据在传输过程中的机密性、完整性。我们采用高强度的加密技术对您的隐私信息进行加密存储，我们严格控制用户信息的访问和使用:我们注重信息和数据的安全存储和使用。对于所有员工使用前我们都会经过背景调查，并要求员工提供犯罪记录证明，全员签署《保密协议》，明确用户信息保护责任:我们定期开展信息安全、隐私保护培训和意识宣贯不断提升员工.的信息安全和用户隐私保护意识。
      <br />
      (二)同时我们也不断借鉴和吸收国内外信息安全和隐私标准，日前，“{{
        setting.appName
      }}”在信息安全和隐私安全方面已取得IS0/IEC
      27001国际信息安全管理体系认证、信息安全等级保护三级认证等国际及国内权威认证标准的要求。

      <br />
      (三)我们会采取一切合理可行的措施，确保未收集相关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
      <br />
      (四）我们有责任和义务提醒您互联网并非绝对安全的环境，我们建议您按照要求使用复杂密码，不要泄露自己的密码/验证码，不要随意转借账号和设备给他人使用，注意保护您的设冬和个人信息安全。如在公共设备上历录使用“{{
        setting.appName
      }}”的服务切勿记住密码，使用完毕后及时退出登录，谍防被他人留用等。如您发现您的账号出现异常或盗用时，请及时修改您的密码；必要时可按照本政策中告知的方式与我们取得联系寻求帮忙。
      <br />
      (五)如果由于我们的物理、技术、或管理防护设施不完备遭到外部恶意入慢和破坏，导致您的信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
      <br />
      (六)在不幸发生个人信息安全事件后，我们将按照法律法规的要求及时向您告知:安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。事件相关情况我们将以邮件、信函、电话或推送通知的方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们
      还将按照监管部门要求，上报个人信息安全事件的处置情况。
      <br />
      (七)您通过“{{
        setting.appName
      }}”平台提交个人信息，代表您同意并授权给我们收集、使用、共享和保护您的个人信息，若您因特殊原因申请收回授权，请及时联系我们，以便于我们做相应处理。

      <br />
      <br />
      <view class="bold">五、您如何管理个人信息</view>
      我们非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括:
      <br />
      (一)访问、更正
      <br />
      我们鼓励您及时更新和修改您的信息以使其准确有效。除法律规定外，您有权访问您的信息，并根据对应信息的管理方或行完成或要求我们进行修改、补充。您可以联系我们的人工客服(电话:{{
        setting.telphone
      }}），申请更正您的信息，我们承诺在15个工作日内完成核查和处理。
      在访问、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障您的账户安全。
      <br />
      (二）删除
      <br />
      在以下情形中，您可以通过联系我们的人工客服(电话：{{
        setting.telphone
      }}）向我们提出删除个人信息的请求:
      <br />
      1.如果我们处理个人信息的行为违反法律法规;
      <br />
      2.如果我们收集、使用您的个人信息，却未征得您的授权同意;
      <br />
      3.如果我们处理个人信息的行为违反了与您的约定;
      <br />
      4.如果您不再使用我们的产品或服务，或您注销了账号;
      <br />
      5.如果我们终止服务及运营。
      <br />
      (三)拒绝、返还、转移、索取数据副本
      <br />
      您可以通过联系我们的人工客服(电话：{{
        setting.telphone
      }}）向我们提出拒绝、返还、转移、索取个人信息副本的请求。我们承诺在15个工作日内完成核查和处理。
      <br />
      (四)改变您授权同意的范围
      <br />
      每个业务功能需要-一些基本的个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。
      <br />
      您可以联系我们的人工客服（电话：{{ setting.telphone }}），收回您的授权同意。
      <br />
      当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
      <br />
      (五）提出异议
      <br />
      若您认为我们对您个人信息的处理违反了本政策或相关法律法规的要求，您可以联系我们的人工客服（电话：{{
        setting.telphone
      }}）提出您的异议。您的每一条宝贵建议我们承诺在15个工.作日内完成回复和处理。
      <br />
      (六)注销
      <br />
      在您需要终止使用我们的服务时，您可以申请注销您的账户，您可以联系我们的人工客服（电话：{{
        setting.telphone
      }}），申请注销您的账户。我们承诺在15个工作日内完成核查和处理。
      我们在此善意地提醒您，您注销账户的行为会使您无法继续使用“{{
        setting.appName
      }}”的相关服务。包括合同下载以及出证服务。注销账户后您的个人信息会保持不可被检索、访问的状态，我们将不会再使用或对外提供与该账户相关的个人信息，但您在使用“{{
        setting.appName
      }}”服务期间提供或产生的信息我们仍需按照《中华人民共和国电子签名法》的相关要求保存5年以上，且在保存的时间内依法配合有权机关的查询。

      <br />
      <br />
      <view class="bold">六、本政策如何更新</view>
      <br />
      (一）为了给您提供更好的服务，本隐私政策也会随之更新。我们会通过在“{{
        setting.appName
      }}”网站、移动端上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问“{{
        setting.appName
      }}”以便及时了解最新的隐私政策。
      <br />
      (二）对于重大变更，我们还含提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。
      <br />
      本政策所指的重大变更包括但不限于:
      <br />
      1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等;
      <br />
      2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等;
      <br />
      3.个人信息共享、转让或公开披露的主要对象发生变化;
      <br />
      4.第三方供应商合作发生变更时;
      <br />
      5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
      <br />
      6.个人信息安全影响评估报告表明存在高风险时。

      <br />
      <br />
      <view class="bold">七、如何联系我们</view>
      如您对本隐私政策有任何问题、意见或建议，或者需要就个人信息安全进行投诉、举报的，请通过拨打我们的客服电话(电话：{{
        setting.telphone
      }}）或通过邮寄等多种方或与我们联系。我们邮寄联系地址如下：{{ setting.address }}收
      <br />
      我们将在15个工作日内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益时，您还可以通过向公司所在地人民法院提起诉讼的方式寻求解决方案。
    </view>
    <!-- <empty msg='勤奋的小编正在编辑中···' v-if="noData"></empty> -->
  </view>
</template>

<script>
import setting from '@/static/config/setting.js';
export default {
  components: {},
  data() {
    return {
      setting,
      loading: true,
      pageData: '',
    };
  },
  computed: {
    noData() {
      return !this.loading && !this.pageData;
    },
  },
  onLoad() {},
};
</script>

<style lang="scss" scoped>
.page {
  padding: 32rpx;
  // background: url('@/static/ImgBackWatermark.png');
  // background-repeat: repeat-y;
  // background-attachment: fixed;
  // background-size: 100%;
}

.content {
  overflow-y: auto;
  // padding: 24rpx;
  text-align: justify;
  word-break: break-all;
  line-height: 40rpx;
  padding-bottom: 60rpx;
  .bold {
    font-size: 30rpx;
    margin-bottom: 10rpx;
  }
  ._br {
    height: 20rpx;
  }
}
</style>